---
layout: post
title:  "R벤치마크 - 데이터 불러오기"
date:   2018-09-10 18:00:00
categories: ETC
author : DANBI
cover: "/assets/etc/r_speed_benchmark/r_logo.png
---

# 데이터 시각화 유의사항

이전 글에서 언급했듯이, 데이터 시각화를 활용화면, 데이터가 갖고 있는 정보를 압축하여 효율적이고 명확하게 전달 가능합니다. 시각화 자료는 파워포인트, 엑셀의 보급과 함께, 학자뿐만 아니라 일반인들도 쉽게 접할 수 있는 자료가 되었고, 웬만한 보고서뿐만 아니라 TV 뉴스, 기사, 예능 프로그램 등 모든 매체를 통해 쉽게 접할 수 있는 우리삶의 필수적인 요소가 되었습니다. 인터넷의 발달, 이미지 공유 SNS (인스타그램 등)의 발달, 인터넷 커뮤니티의 발달 등 다양한 이유로 쉽게 많은 시각화 자료들을 접할 수 있는데요, 이렇다보니 시각화 자료 창작자들은 독자의 눈을 사로잡기 위해, 다약한 색을 조합하고, 새로운 테마를 구성하고, 캐릭터를 추가하는 등 좋은 시각화 자료를 만들기 위해 경쟁하며 노력하고 있습니다. 하지만, 이런 노력에도 불구하고 비효율적이거나  잘못된 의미를 전달하는 시각화 자료를 종종 접하게 됩니다. 잘못된 시각화 자료는 내포하는 정보를 왜곡하여 전달 할 뿐만 아니라, 독자를 혼란에 빠트릴 수도 있습니다. 효과적인 정보전달의 정반대의 결과를 초래하게 되는것이죠. 

본글에서는 제가 겪고 들은 몇몇의 잘못된 시각화 방법의 예시와 해결책에 대하여 얘기하고자 합니다.

### 빨주노초파남보, 내 그래프는 무지개다 !

일반적으로 사람의 눈은 수만가지의 색을 구분할 수 있다고 합니다. 하지만, 실제로 쉽게 구분가능한 색상들은 그리 많지 않습니다. 또한, 컴퓨터 모니터 또는 프린터 출력물로 보는경우, 모니터 및 프린터의 사양에 따라 색들이 조금 다르게 표현되는 경우도 있어, 색을 구분하기 어려운 경우가 종종 있습니다. 예를 들어, 아래의 3개의 직사각형을 봐주시기 바랍니다. 여러분들은 세 사각형의 색이 구분 가능하신가요? 

![색 구분](G:\2018년\12. 블로그 글\시각화 유의점\색 구분.PNG)

두번째 사각형이 다른 색이라는 것은 꽤나 쉽게 분별이 가능하지만, 첫번째와 세번째 사각형이 다르다는 것은 구분하기 어려워보입니다.

![색 구분2](G:\2018년\12. 블로그 글\시각화 유의점\색 구분2.PNG)

위와같이 세 직사각형을 합쳐서 비교하면, 각각의 사각형이 다른 색으로 채워졌다 것을 보다 확실히 알 수 있습니다. 이렇듯, 비슷한 색을 사용하는 경우, 색간의 공간의 유무, 색의 배치 등 다양한 조건에 따라 분별력이 크게 차이나게 됩니다. 이런 비슷한 색들을 이용하여 그래프를 그리게 되면 어떻게 될까요? 

다음은 2018년 6,7,8월간 대한민국 행정구역별 인구 변화를 나타내는 그래프입니다. 

![rainbow](G:\2018년\12. 블로그 글\시각화 유의점\rainbow.png)

압도적으로 많은 인구를수를 자랑하는 두 행정구역 (빨간색 표기)이 어디인가요? 위 그래프에 따르면, 대구,대전, 부산 중 어떤 행정구역에 더 많은 사람들이 살고있나요? 이렇게 색깔을 이용하여 다수의 그룹을 구분 짓는 것은 분별력이 매우 떨어지며, 통상 구별대상이 6개 이상인 경우 적합하지 않습니다. 6쌍의 대비/분별력이 좋은 색을 찾는 것이 쉽지 않기 때문입니다. 그렇기 때문에 무지개색의 휘황찬란한 그래프는 명료하게 정보를 전달하는 좋은 시각화 방법이 아닙니다. 그렇다면, 어떻게 수 (17개 행정구영)를 구분하여 시각화하는 것이 좋을까요? 

먼저, 아래와 같이 표로서 행정구역별 인구 변화를 표현하는 방법이 있습니다. 

![rainbow_table](G:\2018년\12. 블로그 글\시각화 유의점\rainbow_table.png)

이 경우, 각 구역별 인구의 변화를 명확하게 전달 할 수 있지만, 지역간 비교가 어렵우며, 추세를 파악하기 어렵습니다. 서울의 인구는 6-8월간 감소세를 보였지만, 제주도, 경상북도, 세종시 등은 인구가 증가하였는데요, 이를 상기 표를 이용하여 한눈에 확인하기는 쉽지 않습니다. 





### 분할

그렇다면, 위 데이터를 그룹별로 구분하면서, 대략적인 추세를 한눈에 파악가능하기 위해서는 그래프를 어떻게 수정하는 것이 좋을까요?  한 그래프에 모든 행정구역의 인구 변화를 보여주는 것이 아니라, 적절한 기준에 따라 3~4개의 그래프로 분할하여 나타내는 것이 필요해 보입니다. 그 이유는, 행정구역이 17개나 되어 한번에 표현하는 경우 구분이 어려우며, 몇몇 지역들의 인구는 눈으로는 분간이 힘들정도로 비슷하기 때문입니다 (대전 vs 광주  그리고 전남 vs 전북). 따라서 저는 17개의 행정 구역을, 경상도 (경상남도, 경상북도), 전라도(전라남도, 전라북도), 충청도 (충정북도, 충청남도), 광역시 (서울, 부산, 인천, 대구, 대전, 광주, 울산, 세종), 그리고 경기, 강원, 제주를 한 그룹으로 분류하였으며, 아래와 같이 총 5개의 그래프로 인구의 변화를 표현하였습니다. 또한, 행정구역명을 표시하여, 조금더 효과적으로 구역간 구분이 되도록 하였습니다. 그 결과, 이전 그래프 대비, 쉽게 행정구역별 각각 인구의 변화 파악이 가능해졌습니다.![rainbow_facet](G:\2018년\12. 블로그 글\시각화 유의점\rainbow_facet.png)

한마디로 요약하면, 되도록이면 한면에 **7개 이상의 데이터를 표현**하지 말자. 



### 우리의 소원은 통일

여러 그래프를 사용하는 경우, 유의해야 할 사항이 있습니다. 바로 그래프간 요소 (사용한 색, x,y축, 단위 등)를 통일 시키는 것입니다. 각 그래프별로 나타내는 데이터 자체가 다르지 않는 경우에는 그래프간 요소들을 통일해주는 것이 좋습니다. 매우 비슷한 인구를 보이는 전남과 전북의 인구를 예시 그래프들과 함께 자세히살펴보도록 하겠습니다. 

![wrong_1](G:\2018년\12. 블로그 글\시각화 유의점\wrong_1.png)

위의 4개의 그래프는 각각 전남과 전북 지역의 6-8월 평균 인구 수, 6월, 7월 그리고 8월 인구수를 나타내는 그래프입니다. 먼저 가장 눈에 듸는 것은 



### 범례라고 쓰고 legend라 읽는다. 쓰지 말자

### 필요한 정보만 

​	정보는 데이터 말고, break, sub break도 포함된다

​	grid의 중요성 

### 귀찮은건 알지만.... 라벨, 단위

### 그래프 축도 냉면도 자르지 말자

### 겹쳐도 보이게

### 3D, 댓츠 노노

​	

